Revit 2026 API

# ApplicationSetSystemsAnalysisWorkflows Method

---
**Namespace:** Autodesk.Revit.ApplicationServices**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public void SetSystemsAnalysisWorkflows(
	IDictionary<string, string> paths
)
```
```vb
Public Sub SetSystemsAnalysisWorkflows (
	paths As IDictionary(Of String, String)
)
```
```cpp
public:
void SetSystemsAnalysisWorkflows(
	IDictionary<String^, String^>^ paths
)
```
```fsharp
member SetSystemsAnalysisWorkflows :
        paths : IDictionary<string, string> -> unit
```

#### Parameters

paths IDictionaryString, String

#### Reference

Application Class

Autodesk.Revit.ApplicationServices Namespace